Page({
  data: {
    tableData: [
      {rank: '一等奖', money: '浮动(最高1000万)', condition: [
        [1, 1, 1, 1, 1, 1, 2]
      ]},
      {rank: '二等奖', money: '浮动(最高500万)', condition: [
        [1, 1, 1, 1, 1, 1, 0]
      ]},
      {rank: '三等奖', money: '3000元', condition: [
        [1, 1, 1, 1, 1, 0, 2]
      ]},
      {rank: '四等奖', money: '200元', condition: [
        [1, 1, 1, 1, 1, 0, 0],
        [1, 1, 1, 1, 0, 0, 2]
      ]},
      {rank: '五等奖', money: '10元', condition: [
        [1, 1, 1, 1, 0, 0, 0],
        [1, 1, 1, 0, 0, 0, 2]
      ]},
      {rank: '六等奖', money: '5元', condition: [
        [1, 1, 0, 0, 0, 0, 2],
        [1, 0, 0, 0, 0, 0, 2],
        [0, 0, 0, 0, 0, 0, 2]
      ]}
    ]
  }
})